{
  "pokemon.species": [
    "abomasnow",
    "alcremie",
    "alcremiecaramelswirl",
    "alcremielemoncream",
    "alcremiematchacream",
    "alcremiemintcream",
    "alcremierainbowswirl",
    "alcremierubycream",
    "alcremierubyswirl",
    "alcremiesaltedcream",
    "alomomola",
    "altaria",
    "ambipom",
    "amoonguss",
    "ampharos",
    "annihilape",
    "appletun",
    "araquanid",
    "arbok",
    "arboliva",
    "arcanine",
    "arcaninehisui",
    "arceus",
    "arceusbug",
    "arceusdark",
    "arceusdragon",
    "arceuselectric",
    "arceusfairy",
    "arceusfighting",
    "arceusfire",
    "arceusflying",
    "arceusghost",
    "arceusgrass",
    "arceusground",
    "arceusice",
    "arceuspoison",
    "arceuspsychic",
    "arceusrock",
    "arceussteel",
    "arceuswater",
    "archaludon",
    "ariados",
    "armarouge",
    "articuno",
    "articunogalar",
    "avalugg",
    "avalugghisui",
    "azelf",
    "azumarill",
    "banette",
    "barraskewda",
    "basculegion",
    "basculegionf",
    "basculin",
    "basculinbluestriped",
    "bastiodon",
    "baxcalibur",
    "beartic",
    "bellibolt",
    "bellossom",
    "bisharp",
    "blastoise",
    "blaziken",
    "blissey",
    "bombirdier",
    "brambleghast",
    "braviary",
    "braviaryhisui",
    "breloom",
    "bronzong",
    "brutebonnet",
    "bruxish",
    "cacturne",
    "calyrex",
    "calyrexice",
    "calyrexshadow",
    "camerupt",
    "carbink",
    "ceruledge",
    "cetitan",
    "chandelure",
    "chansey",
    "charizard",
    "chesnaught",
    "chienpao",
    "chimecho",
    "chiyu",
    "cinccino",
    "cinderace",
    "clawitzer",
    "clefable",
    "clodsire",
    "cloyster",
    "coalossal",
    "cobalion",
    "comfey",
    "conkeldurr",
    "copperajah",
    "corviknight",
    "crabominable",
    "cramorant",
    "crawdaunt",
    "cresselia",
    "cryogonal",
    "cyclizar",
    "dachsbun",
    "darkrai",
    "decidueye",
    "decidueyehisui",
    "dedenne",
    "delibird",
    "delphox",
    "deoxys",
    "deoxysattack",
    "deoxysdefense",
    "deoxysspeed",
    "dewgong",
    "dialga",
    "dialgaorigin",
    "diancie",
    "dipplin",
    "ditto",
    "dodrio",
    "dondozo",
    "donphan",
    "dragalge",
    "dragapult",
    "dragonite",
    "drednaw",
    "drifblim",
    "dudunsparce",
    "dudunsparcethreesegment",
    "dugtrio",
    "dugtrioalola",
    "dunsparce",
    "duraludon",
    "dusknoir",
    "eelektross",
    "eiscue",
    "eiscuenoice",
    "electivire",
    "electrode",
    "electrodehisui",
    "emboar",
    "empoleon",
    "enamorus",
    "enamorustherian",
    "entei",
    "espathra",
    "espeon",
    "eternatus",
    "excadrill",
    "exeggutor",
    "exeggutoralola",
    "falinks",
    "farigiraf",
    "feraligatr",
    "fezandipiti",
    "flamigo",
    "flapple",
    "flareon",
    "floatzel",
    "florges",
    "florgesblue",
    "florgesorange",
    "florgeswhite",
    "florgesyellow",
    "fluttermane",
    "flygon",
    "forretress",
    "froslass",
    "frosmoth",
    "furret",
    "gallade",
    "galvantula",
    "garchomp",
    "gardevoir",
    "garganacl",
    "gastrodon",
    "gastrodoneast",
    "gengar",
    "gholdengo",
    "girafarig",
    "giratina",
    "giratinaorigin",
    "glaceon",
    "glalie",
    "glastrier",
    "glimmora",
    "gliscor",
    "gogoat",
    "golduck",
    "golem",
    "golemalola",
    "golurk",
    "goodra",
    "goodrahisui",
    "gothitelle",
    "gougingfire",
    "grafaiai",
    "granbull",
    "greattusk",
    "greedent",
    "greninja",
    "grimmsnarl",
    "groudon",
    "grumpig",
    "gumshoos",
    "gurdurr",
    "gyarados",
    "hariyama",
    "hatterene",
    "hawlucha",
    "haxorus",
    "heatran",
    "heracross",
    "hippowdon",
    "hitmonchan",
    "hitmonlee",
    "hitmontop",
    "honchkrow",
    "hooh",
    "hoopa",
    "hoopaunbound",
    "houndoom",
    "houndstone",
    "hydrapple",
    "hydreigon",
    "hypno",
    "illumise",
    "incineroar",
    "indeedee",
    "indeedeef",
    "infernape",
    "inteleon",
    "ironboulder",
    "ironbundle",
    "ironcrown",
    "ironhands",
    "ironjugulis",
    "ironleaves",
    "ironmoth",
    "ironthorns",
    "irontreads",
    "ironvaliant",
    "jirachi",
    "jolteon",
    "jumpluff",
    "keldeoresolute",
    "kilowattrel",
    "kingambit",
    "kingdra",
    "klawf",
    "kleavor",
    "klefki",
    "komala",
    "kommoo",
    "koraidon",
    "kricketune",
    "krookodile",
    "kyogre",
    "kyurem",
    "kyuremblack",
    "kyuremwhite",
    "landorus",
    "landorustherian",
    "lanturn",
    "lapras",
    "latias",
    "latios",
    "leafeon",
    "leavanny",
    "lilligant",
    "lilliganthisui",
    "lokix",
    "lucario",
    "ludicolo",
    "lugia",
    "lumineon",
    "lunala",
    "lurantis",
    "luvdisc",
    "luxray",
    "lycanroc",
    "lycanrocdusk",
    "lycanrocmidnight",
    "mabosstiff",
    "magcargo",
    "magearna",
    "magearnaoriginal",
    "magmortar",
    "magnezone",
    "malamar",
    "mamoswine",
    "manaphy",
    "mandibuzz",
    "masquerain",
    "maushold",
    "mausholdfour",
    "medicham",
    "meganium",
    "meloetta",
    "meowscarada",
    "meowstic",
    "meowsticf",
    "mesprit",
    "metagross",
    "mew",
    "mewtwo",
    "mienshao",
    "mightyena",
    "milotic",
    "mimikyu",
    "mimikyubusted",
    "minior",
    "miniorblue",
    "miniorgreen",
    "miniorindigo",
    "miniororange",
    "miniorviolet",
    "minioryellow",
    "minun",
    "miraidon",
    "misdreavus",
    "mismagius",
    "moltres",
    "moltresgalar",
    "morpeko",
    "morpekohangry",
    "mudsdale",
    "muk",
    "mukalola",
    "munkidori",
    "necrozma",
    "necrozmadawnwings",
    "necrozmaduskmane",
    "ninetales",
    "ninetalesalola",
    "noctowl",
    "noivern",
    "ogerpon",
    "ogerponcornerstone",
    "ogerponcornerstonetera",
    "ogerponhearthflame",
    "ogerponhearthflametera",
    "ogerpontealtera",
    "ogerponwellspring",
    "ogerponwellspringtera",
    "oinkologne",
    "oinkolognef",
    "okidogi",
    "oranguru",
    "oricorio",
    "oricoriopau",
    "oricoriopompom",
    "oricoriosensu",
    "orthworm",
    "overqwil",
    "pachirisu",
    "palafin",
    "palafinhero",
    "palkia",
    "palkiaorigin",
    "palossand",
    "passimian",
    "pawmot",
    "pecharunt",
    "pelipper",
    "perrserker",
    "persian",
    "persianalola",
    "phione",
    "pikachu",
    "pikachualola",
    "pikachuhoenn",
    "pikachukalos",
    "pikachuoriginal",
    "pikachupartner",
    "pikachusinnoh",
    "pikachuunova",
    "pikachuworld",
    "piloswine",
    "pincurchin",
    "plusle",
    "politoed",
    "poliwrath",
    "polteageist",
    "polteageistantique",
    "porygon2",
    "porygonz",
    "primarina",
    "probopass",
    "pyroar",
    "quagsire",
    "quaquaval",
    "qwilfish",
    "qwilfishhisui",
    "rabsca",
    "ragingbolt",
    "raichu",
    "raichualola",
    "raikou",
    "rampardos",
    "rayquaza",
    "regice",
    "regidrago",
    "regieleki",
    "regigigas",
    "regirock",
    "registeel",
    "reshiram",
    "reuniclus",
    "revavroom",
    "rhydon",
    "rhyperior",
    "ribombee",
    "rillaboom",
    "roaringmoon",
    "rotom",
    "rotomfan",
    "rotomfrost",
    "rotomheat",
    "rotommow",
    "rotomwash",
    "sableye",
    "salamence",
    "salazzle",
    "samurott",
    "samurotthisui",
    "sandaconda",
    "sandslash",
    "sandslashalola",
    "sandyshocks",
    "sawsbuck",
    "sawsbuckautumn",
    "sawsbucksummer",
    "sawsbuckwinter",
    "sceptile",
    "scizor",
    "scovillain",
    "scrafty",
    "screamtail",
    "scyther",
    "serperior",
    "seviper",
    "shaymin",
    "shayminsky",
    "shiftry",
    "sinistcha",
    "sinistchamasterpiece",
    "skarmory",
    "skeledirge",
    "skuntank",
    "slaking",
    "slitherwing",
    "slowbro",
    "slowbrogalar",
    "slowking",
    "slowkinggalar",
    "smeargle",
    "sneasler",
    "snorlax",
    "solgaleo",
    "spectrier",
    "spidops",
    "spiritomb",
    "squawkabilly",
    "squawkabillyblue",
    "squawkabillywhite",
    "squawkabillyyellow",
    "staraptor",
    "stonjourner",
    "sudowoodo",
    "suicune",
    "sunflora",
    "swalot",
    "swampert",
    "swanna",
    "sylveon",
    "talonflame",
    "tatsugiri",
    "tatsugiridroopy",
    "tatsugiristretchy",
    "tauros",
    "taurospaldeaaqua",
    "taurospaldeablaze",
    "taurospaldeacombat",
    "tentacruel",
    "terapagos",
    "terapagosstellar",
    "terapagosterastal",
    "terrakion",
    "thundurus",
    "thundurustherian",
    "tinglu",
    "tinkaton",
    "toedscruel",
    "torkoal",
    "tornadus",
    "tornadustherian",
    "torterra",
    "toucannon",
    "toxapex",
    "toxicroak",
    "toxtricity",
    "trevenant",
    "tropius",
    "tsareena",
    "typhlosion",
    "typhlosionhisui",
    "tyranitar",
    "umbreon",
    "ursaluna",
    "ursalunabloodmoon",
    "ursaring",
    "urshifu",
    "urshifurapidstrike",
    "uxie",
    "vaporeon",
    "veluza",
    "venomoth",
    "venusaur",
    "vespiquen",
    "victreebel",
    "vigoroth",
    "vikavolt",
    "vileplume",
    "virizion",
    "vivillon",
    "vivillonarchipelago",
    "vivilloncontinental",
    "vivillonelegant",
    "vivillongarden",
    "vivillonhighplains",
    "vivillonicysnow",
    "vivillonjungle",
    "vivillonmarine",
    "vivillonmodern",
    "vivillonmonsoon",
    "vivillonocean",
    "vivillonpolar",
    "vivillonriver",
    "vivillonsandstorm",
    "vivillonsavanna",
    "vivillonsun",
    "vivillontundra",
    "volbeat",
    "volcanion",
    "volcarona",
    "walkingwake",
    "weavile",
    "weezing",
    "weezinggalar",
    "whimsicott",
    "whiscash",
    "wigglytuff",
    "wochien",
    "wugtrio",
    "wyrdeer",
    "yanmega",
    "zacian",
    "zaciancrowned",
    "zamazenta",
    "zamazentacrowned",
    "zangoose",
    "zapdos",
    "zapdosgalar",
    "zarude",
    "zarudedada",
    "zebstrika",
    "zekrom",
    "zoroark",
    "zoroarkhisui"
  ],
  "pokemon.item": [
    "adamantcrystal",
    "airballoon",
    "assaultvest",
    "boosterenergy",
    "chestoberry",
    "choiceband",
    "choicescarf",
    "choicespecs",
    "cornerstonemask",
    "custapberry",
    "dracoplate",
    "dreadplate",
    "earthplate",
    "eviolite",
    "expertbelt",
    "fistplate",
    "flameorb",
    "flameplate",
    "focussash",
    "griseouscore",
    "hearthflamemask",
    "heavydutyboots",
    "icicleplate",
    "insectplate",
    "ironplate",
    "leftovers",
    "leppaberry",
    "lifeorb",
    "lightball",
    "lightclay",
    "loadeddice",
    "lumberry",
    "lustrousglobe",
    "lustrousorb",
    "magnet",
    "meadowplate",
    "mindplate",
    "pixieplate",
    "powerherb",
    "rockyhelmet",
    "rustedshield",
    "rustedsword",
    "scopelens",
    "silkscarf",
    "silverpowder",
    "sitrusberry",
    "skyplate",
    "souldew",
    "splashplate",
    "spookyplate",
    "stoneplate",
    "throatspray",
    "toxicorb",
    "toxicplate",
    "unknownitem",
    "weaknesspolicy",
    "wellspringmask",
    "whiteherb",
    "widelens",
    "zapplate"
  ],
  "pokemon.ability": [
    "adaptability",
    "aftermath",
    "airlock",
    "analytic",
    "angerpoint",
    "angershell",
    "anticipation",
    "arenatrap",
    "armortail",
    "aromaveil",
    "asoneglastrier",
    "asonespectrier",
    "baddreams",
    "battlearmor",
    "battlebond",
    "beadsofruin",
    "berserk",
    "bigpecks",
    "blaze",
    "bulletproof",
    "cheekpouch",
    "chillingneigh",
    "chlorophyll",
    "clearbody",
    "cloudnine",
    "comatose",
    "commander",
    "competitive",
    "compoundeyes",
    "contrary",
    "corrosion",
    "costar",
    "cudchew",
    "curiousmedicine",
    "cursedbody",
    "cutecharm",
    "damp",
    "dancer",
    "dauntlessshield",
    "dazzling",
    "defiant",
    "disguise",
    "download",
    "dragonsmaw",
    "drizzle",
    "drought",
    "dryskin",
    "earlybird",
    "eartheater",
    "effectspore",
    "electricsurge",
    "electromorphosis",
    "embodyaspectcornerstone",
    "embodyaspecthearthflame",
    "embodyaspectteal",
    "embodyaspectwellspring",
    "filter",
    "flamebody",
    "flareboost",
    "flashfire",
    "flowerveil",
    "fluffy",
    "forewarn",
    "friendguard",
    "frisk",
    "fullmetalbody",
    "furcoat",
    "galewings",
    "galvanize",
    "gluttony",
    "goodasgold",
    "gooey",
    "grasspelt",
    "grassysurge",
    "grimneigh",
    "guarddog",
    "gulpmissile",
    "guts",
    "hadronengine",
    "harvest",
    "healer",
    "heatproof",
    "heavymetal",
    "honeygather",
    "hospitality",
    "hugepower",
    "hungerswitch",
    "hustle",
    "hydration",
    "hypercutter",
    "icebody",
    "iceface",
    "icescales",
    "illuminate",
    "illusion",
    "immunity",
    "imposter",
    "infiltrator",
    "innerfocus",
    "insomnia",
    "intimidate",
    "intrepidsword",
    "ironfist",
    "justified",
    "keeneye",
    "klutz",
    "leafguard",
    "levitate",
    "libero",
    "lightmetal",
    "lightningrod",
    "limber",
    "lingeringaroma",
    "liquidooze",
    "liquidvoice",
    "longreach",
    "magicbounce",
    "magicguard",
    "magician",
    "magmaarmor",
    "magnetpull",
    "marvelscale",
    "megalauncher",
    "merciless",
    "mindseye",
    "minus",
    "mirrorarmor",
    "mistysurge",
    "moldbreaker",
    "moody",
    "motordrive",
    "moxie",
    "multiscale",
    "multitype",
    "myceliummight",
    "naturalcure",
    "neutralizinggas",
    "noguard",
    "oblivious",
    "opportunist",
    "orichalcumpulse",
    "overcoat",
    "overgrow",
    "owntempo",
    "pickpocket",
    "pickup",
    "pixilate",
    "plus",
    "poisonheal",
    "poisonpoint",
    "poisonpuppeteer",
    "poisontouch",
    "powerofalchemy",
    "powerspot",
    "prankster",
    "pressure",
    "prismarmor",
    "propellertail",
    "protean",
    "protosynthesis",
    "psychicsurge",
    "punkrock",
    "purepower",
    "purifyingsalt",
    "quarkdrive",
    "queenlymajesty",
    "quickdraw",
    "quickfeet",
    "raindish",
    "rattled",
    "receiver",
    "reckless",
    "regenerator",
    "ripen",
    "rivalry",
    "rockhead",
    "rockypayload",
    "roughskin",
    "runaway",
    "sandforce",
    "sandrush",
    "sandspit",
    "sandstream",
    "sandveil",
    "sapsipper",
    "scrappy",
    "seedsower",
    "serenegrace",
    "shadowshield",
    "shadowtag",
    "sharpness",
    "shedskin",
    "sheerforce",
    "shellarmor",
    "shielddust",
    "shieldsdown",
    "skilllink",
    "slowstart",
    "slushrush",
    "sniper",
    "snowcloak",
    "snowwarning",
    "solarpower",
    "solidrock",
    "soulheart",
    "soundproof",
    "speedboost",
    "stakeout",
    "stall",
    "stalwart",
    "stamina",
    "static",
    "steadfast",
    "steamengine",
    "steelyspirit",
    "stench",
    "stickyhold",
    "stormdrain",
    "strongjaw",
    "sturdy",
    "suctioncups",
    "superluck",
    "supersweetsyrup",
    "supremeoverlord",
    "surgesurfer",
    "swarm",
    "sweetveil",
    "swiftswim",
    "swordofruin",
    "symbiosis",
    "synchronize",
    "tabletsofruin",
    "tangledfeet",
    "tanglinghair",
    "technician",
    "telepathy",
    "teraformzero",
    "terashell",
    "terashift",
    "teravolt",
    "thermalexchange",
    "thickfat",
    "tintedlens",
    "torrent",
    "toughclaws",
    "toxicboost",
    "toxicchain",
    "toxicdebris",
    "trace",
    "transistor",
    "triage",
    "truant",
    "turboblaze",
    "unaware",
    "unburden",
    "unnerve",
    "unseenfist",
    "vesselofruin",
    "vitalspirit",
    "voltabsorb",
    "waterabsorb",
    "waterbubble",
    "watercompaction",
    "waterveil",
    "weakarmor",
    "wellbakedbody",
    "whitesmoke",
    "windpower",
    "windrider",
    "wonderskin",
    "zerotohero"
  ],
  "pokemon.gender": [
    "female",
    "male",
    "neutral"
  ],
  "pokemon.type": [
    "bug",
    "dark",
    "dragon",
    "electric",
    "fairy",
    "fighting",
    "fire",
    "flying",
    "ghost",
    "grass",
    "ground",
    "ice",
    "normal",
    "poison",
    "psychic",
    "rock",
    "steel",
    "stellar",
    "threequestionmarks",
    "water"
  ],
  "move.id": [
    "accelerock",
    "acrobatics",
    "aeroblast",
    "agility",
    "airslash",
    "alluringvoice",
    "appleacid",
    "aquacutter",
    "aquajet",
    "aquastep",
    "armorcannon",
    "astralbarrage",
    "aurasphere",
    "aurawheel",
    "auroraveil",
    "avalanche",
    "beakblast",
    "beatup",
    "behemothblade",
    "bellydrum",
    "bite",
    "bitterblade",
    "bittermalice",
    "bleakwindstorm",
    "blizzard",
    "bloodmoon",
    "blueflare",
    "bodypress",
    "bodyslam",
    "boltstrike",
    "boomburst",
    "bravebird",
    "brickbreak",
    "bugbite",
    "bugbuzz",
    "bulkup",
    "bulletpunch",
    "bulletseed",
    "calmmind",
    "ceaselessedge",
    "chillyreception",
    "circlethrow",
    "clangingscales",
    "clangoroussoul",
    "clearsmog",
    "closecombat",
    "coil",
    "collisioncourse",
    "cosmicpower",
    "courtchange",
    "crabhammer",
    "crunch",
    "curse",
    "darkpulse",
    "dazzlinggleam",
    "defog",
    "destinybond",
    "diamondstorm",
    "direclaw",
    "disable",
    "discharge",
    "doubleedge",
    "doubleshock",
    "dracometeor",
    "dragonascent",
    "dragonclaw",
    "dragondance",
    "dragondarts",
    "dragonenergy",
    "dragonpulse",
    "dragontail",
    "drainingkiss",
    "drainpunch",
    "drillrun",
    "dualwingbeat",
    "dynamaxcannon",
    "dynamicpunch",
    "earthpower",
    "earthquake",
    "electrodrift",
    "encore",
    "endeavor",
    "energyball",
    "eruption",
    "esperwing",
    "expandingforce",
    "explosion",
    "extremespeed",
    "facade",
    "fakeout",
    "ficklebeam",
    "fierydance",
    "fierywrath",
    "filletaway",
    "fireblast",
    "firefang",
    "firepunch",
    "firstimpression",
    "flamecharge",
    "flamethrower",
    "flareblitz",
    "flashcannon",
    "fleurcannon",
    "flipturn",
    "flowertrick",
    "focusblast",
    "focuspunch",
    "foulplay",
    "freezedry",
    "freezingglare",
    "fusionbolt",
    "fusionflare",
    "futuresight",
    "gigadrain",
    "gigaimpact",
    "gigatonhammer",
    "glaciallance",
    "glaiverush",
    "glare",
    "grassknot",
    "grassyglide",
    "gravapple",
    "gunkshot",
    "haze",
    "headbutt",
    "headlongrush",
    "headsmash",
    "healbell",
    "healingwish",
    "heatcrash",
    "heatwave",
    "heavyslam",
    "hex",
    "highhorsepower",
    "highjumpkick",
    "hornleech",
    "hurricane",
    "hydropump",
    "hydrosteam",
    "hyperspacefury",
    "hypervoice",
    "hypnosis",
    "icebeam",
    "icefang",
    "icehammer",
    "icepunch",
    "iceshard",
    "icespinner",
    "iciclecrash",
    "iciclespear",
    "irondefense",
    "ironhead",
    "irontail",
    "ivycudgel",
    "jetpunch",
    "judgment",
    "knockoff",
    "kowtowcleave",
    "lashout",
    "lavaplume",
    "leafblade",
    "leafstorm",
    "leechlife",
    "leechseed",
    "lightscreen",
    "liquidation",
    "lowkick",
    "luminacrash",
    "lunge",
    "lusterpurge",
    "machpunch",
    "magmastorm",
    "magnetrise",
    "makeitrain",
    "malignantchain",
    "matchagotcha",
    "megahorn",
    "meteorbeam",
    "meteormash",
    "mightycleave",
    "milkdrink",
    "mirrorcoat",
    "moonblast",
    "moongeistbeam",
    "moonlight",
    "morningsun",
    "mortalspin",
    "muddywater",
    "mudshot",
    "mysticalfire",
    "nastyplot",
    "nightshade",
    "nightslash",
    "noretreat",
    "nuzzle",
    "originpulse",
    "outrage",
    "overdrive",
    "overheat",
    "painsplit",
    "partingshot",
    "payback",
    "petalblizzard",
    "petaldance",
    "photongeyser",
    "playrough",
    "poisonfang",
    "poisonjab",
    "pollenpuff",
    "poltergeist",
    "populationbomb",
    "pounce",
    "powergem",
    "powertrip",
    "powerwhip",
    "precipiceblades",
    "protect",
    "psyblade",
    "psychic",
    "psychicfangs",
    "psychicnoise",
    "psychoboost",
    "psychocut",
    "psyshock",
    "psystrike",
    "pyroball",
    "quickattack",
    "quiverdance",
    "ragefist",
    "ragingbull",
    "raindance",
    "rapidspin",
    "razorshell",
    "recharge",
    "recover",
    "reflect",
    "relicsong",
    "rest",
    "revelationdance",
    "revivalblessing",
    "roar",
    "rockblast",
    "rockpolish",
    "rockslide",
    "rocktomb",
    "roost",
    "ruination",
    "sacredfire",
    "sacredsword",
    "saltcure",
    "scald",
    "scaleshot",
    "scorchingsands",
    "secretsword",
    "seedbomb",
    "seedflare",
    "seismictoss",
    "shadowball",
    "shadowclaw",
    "shadowsneak",
    "shedtail",
    "shellsidearm",
    "shellsmash",
    "shiftgear",
    "shoreup",
    "slackoff",
    "sleeppowder",
    "sleeptalk",
    "sludgebomb",
    "sludgewave",
    "snowscape",
    "softboiled",
    "solarbeam",
    "spacialrend",
    "sparklingaria",
    "spikes",
    "spiritbreak",
    "spiritshackle",
    "spore",
    "stealthrock",
    "steameruption",
    "stickyweb",
    "stompingtantrum",
    "stoneaxe",
    "stoneedge",
    "storedpower",
    "strangesteam",
    "strengthsap",
    "struggle",
    "stunspore",
    "substitute",
    "suckerpunch",
    "sunnyday",
    "sunsteelstrike",
    "supercellslam",
    "superfang",
    "superpower",
    "surf",
    "surgingstrikes",
    "switcheroo",
    "swordsdance",
    "synthesis",
    "tachyoncutter",
    "tailglow",
    "tailslap",
    "tailwind",
    "takeheart",
    "taunt",
    "teleport",
    "temperflare",
    "terablast",
    "terastarstorm",
    "throatchop",
    "thunder",
    "thunderbolt",
    "thunderclap",
    "thunderpunch",
    "thunderwave",
    "tidyup",
    "torchsong",
    "toxic",
    "toxicspikes",
    "trailblaze",
    "transform",
    "triattack",
    "trick",
    "trickroom",
    "triplearrows",
    "tripleaxel",
    "uturn",
    "vacuumwave",
    "victorydance",
    "voltswitch",
    "volttackle",
    "waterfall",
    "waterpulse",
    "waterspout",
    "wavecrash",
    "weatherball",
    "whirlpool",
    "whirlwind",
    "wickedblow",
    "wildcharge",
    "willowisp",
    "wish",
    "woodhammer",
    "workup",
    "xscissor",
    "yawn",
    "zenheadbutt",
    "zingzap"
  ],
  "move.type": [
    "bug",
    "dark",
    "dragon",
    "electric",
    "fairy",
    "fighting",
    "fire",
    "flying",
    "ghost",
    "grass",
    "ground",
    "ice",
    "normal",
    "poison",
    "psychic",
    "rock",
    "steel",
    "water"
  ],
  "move.category": [
    "physical",
    "special",
    "status"
  ],
  "move.target": [
    "all",
    "alladjacent",
    "alladjacentfoes",
    "allyside",
    "allyteam",
    "any",
    "foeside",
    "normal",
    "randomnormal",
    "scripted",
    "self"
  ],
  "pokemon.effect": [
    "attract",
    "battlebond",
    "beakblast",
    "charge",
    "confusion",
    "courtchange",
    "cudchew",
    "curse",
    "custapberry",
    "dancer",
    "destinybond",
    "disable",
    "disguise",
    "electricterrain",
    "encore",
    "fallen1",
    "fallen2",
    "fallen3",
    "fallen4",
    "fallen5",
    "ficklebeam",
    "flashfire",
    "focuspunch",
    "futuresight",
    "glaiverush",
    "gulpmissile",
    "hadronengine",
    "healbell",
    "healblock",
    "hydration",
    "hyperspacefury",
    "iceface",
    "insomnia",
    "leechseed",
    "leppaberry",
    "magmastorm",
    "magnetrise",
    "noretreat",
    "orichalcumpulse",
    "poltergeist",
    "protect",
    "protosynthesis",
    "protosynthesisatk",
    "protosynthesisdef",
    "protosynthesisspa",
    "protosynthesisspd",
    "protosynthesisspe",
    "psychicterrain",
    "quarkdrive",
    "quarkdriveatk",
    "quarkdrivedef",
    "quarkdrivespa",
    "quarkdrivespe",
    "roost",
    "saltcure",
    "shedskin",
    "slowstart",
    "stickyhold",
    "stickyweb",
    "struggle",
    "substitute",
    "supremeoverlord",
    "synchronize",
    "taunt",
    "terashell",
    "terashift",
    "thermalexchange",
    "throatchop",
    "tidyup",
    "toxicdebris",
    "trapped",
    "trick",
    "typechange",
    "vitalspirit",
    "waterbubble",
    "waterveil",
    "whirlpool",
    "yawn",
    "zerotohero"
  ],
  "pokemon.status": [
    "brn",
    "fnt",
    "frz",
    "par",
    "psn",
    "slp",
    "tox"
  ],
  "global.side_condition": [
    "auroraveil",
    "lightscreen",
    "reflect",
    "spikes",
    "stealthrock",
    "stickyweb",
    "tailwind",
    "toxicspikes"
  ],
  "global.weather": [
    "raindance",
    "sandstorm",
    "snowscape",
    "sunnyday"
  ],
  "global.field": [
    "electricterrain",
    "grassyterrain",
    "psychicterrain",
    "trickroom"
  ]
}